module.exports.config = {
name: 'autosent',
version: '1.0.1',
hasPermssion: 0,
credits: 'MrAaryan',
description: 'Set Karne Ke Bad Automatically Msg Send Karega',
commandCategory: 'group messenger',
usages: '[]',
cooldowns: 3
};
const nam = [{
timer: '12:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:30 P𝐌 ⏳\n\n   सोने का टाइम होगया सबको शुभ रात्रि🥰\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '1:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:30 𝗔𝐌 ⏳\n\n सो जाओ बाबू शुभ रात्रि💝\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '2:00:00 AM',
message: ['✮͢𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:30 A𝐌 ⏳\n\nमैं भी जाग रहा हूं अभी तक😉\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '3:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:30 A𝐌 ⏳\n\nतुम अभी तक सोए नहीं 😳\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '4:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:30 A𝐌 ⏳\n\nअच्छा होगा नींद आ जाए 🙁\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '5:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:30 A𝐌 ⏳\n\nनींद आओ ना जल्दी 🥹\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '6:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:30 𝗔𝐌 ⏳\n\nउठो सारे अलसी लोग 😹\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '7:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:30 A𝐌 ⏳\n\n💝सुप्रभात सबको'😌💝\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '8:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:30 𝗔𝐌 ⏳\n\nराधे राधे सबको: 🙏🏻💝\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '9:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:30 A𝐌 ⏳\n\nउठ गए प्रेसिडेंट जी आप?\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '10:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:30 A𝐌 ⏳\n\nबाबू सोने वाले ब्रेकफास्ट कर लो🙈\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '11:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:30 A𝐌 ⏳\n\nठरकी सारे कहां गए?🙀\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '12:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:30 A𝐌 ⏳\n\nमुझे भी याद कर लिया करो😻\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '1:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:30 𝐀𝐌 ⏳\n\nकितनी ठंडी है बाहर🥶\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '2:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:30 𝐏𝐌 ⏳\n\nबाबू अब खाना खा लो😇\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '3:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:30 𝐏𝐌 ⏳\n\nयार तुम लोग कुछ काम धाम कर लो 😶😐\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '4:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:30 𝐏𝐌 ⏳\n\nथोड़ा आराम कर लो अब बेबी😘\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '5:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:30 𝐏𝐌 ⏳\n\nआज बहुत गर्मी है 🙆🏻\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '6:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:30 𝐏𝐌 ⏳\n\nतुम लोग ठरकी हो 🤦🏻\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '7:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:30 𝐏𝐌 ⏳\n\nसत्यमेव जयते है सनातन 💖\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '8:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:30 𝐏𝐌 ⏳\n\nखुश रहा करो हमेशा 💞\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '9:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:30 𝐏𝐌 ⏳\n\nडिनर कर लो सारे 😋\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '10:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:30 𝐏𝐌 ⏳\n\nउफ्फ बाबू सोना जादू टोना 🤦🏻 \n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '11:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:30 P𝐌 ⏳\n\nआयांश बाबू खाना खाया आपने?\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};