module.exports.config = {
name: 'autosent',
version: '1.0.1',
hasPermssion: 0,
credits: 'MrAaryan',
description: 'Set Karne Ke Bad Automatically Msg Send Karega',
commandCategory: 'group messenger',
usages: '[]',
cooldowns: 3
};
const nam = [{
timer: '12:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:30 P𝐌 ⏳\n𝐒𝐨 𝐉𝐚𝐨 𝐁𝐚𝐛𝐲 𝐆𝐨𝐨𝐝 𝐍𝐢𝐠𝐡𝐭💝\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '1:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:30 𝗔𝐌 ⏳\n𝐌𝐚𝐢 𝐛𝐡𝐢 𝐉𝐚𝐠 𝐫𝐚𝐡𝐚 𝐡𝐮 𝐚𝐛𝐡𝐢 𝐭𝐚𝐤😉\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '2:00:00 AM',
message: ['✮͢𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:30 A𝐌 ⏳\n𝗧𝘂𝗺 𝗔𝗯𝗵𝗶 𝗧𝗮𝗸 𝗦𝗼𝘆𝗲 𝗡𝗵𝗶 😳\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '3:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:30 A𝐌 ⏳\n𝐀𝐜𝐜𝐡𝐚 𝐡𝐨𝐠𝐚 𝐍𝐞𝐞𝐧𝐝 𝐀𝐚𝐣𝐚𝐲𝐞🌃\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '4:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:30 A𝐌 ⏳\n𝐍𝐞𝐞𝐧𝐝 𝐀𝐚𝐣𝐚𝐲𝐞 💝\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '5:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:30 A𝐌 ⏳\nAalsi log utho 😹\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '6:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:30 𝗔𝐌 ⏳\n𝐆𝐨𝐨𝐝 𝐦𝐨𝐫𝐧𝐢𝐧𝐠 𝐬𝐚𝐛𝐤𝐨'😌💝\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '7:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:30 A𝐌 ⏳\n𝐑𝐚𝐝𝐡𝐞 𝐑𝐚𝐝𝐡𝐞 𝐬𝐚𝐛𝐤𝐨: 🙏🏻💝\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '8:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:30 𝗔𝐌 ⏳\n𝐔𝐭𝐡 𝐆𝐲𝐞 𝐏𝐫𝐞𝐬𝐢𝐝𝐞𝐧𝐭 𝐣𝐈 𝐀𝐚𝐩?😵\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '9:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:30 A𝐌 ⏳\n𝐁𝐫𝐞𝐚𝐤𝐟𝐚𝐬𝐭 𝐊𝐚𝐫𝐥𝐨 𝐀𝐛 𝐁𝐚𝐛𝐲🙈\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '10:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:30 A𝐌 ⏳\n𝐀𝐚𝐥𝐬𝐢 𝐀𝐚𝐣 𝐂𝐨𝐥𝐥𝐞𝐠𝐞 𝐍𝐚𝐡𝐢 𝐆𝐚𝐲𝐞?🙀\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '11:00:00 AM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:30 A𝐌 ⏳\n𝐌𝐮𝐣𝐡𝐞 𝐁𝐡𝐢 𝐘𝐚𝐚𝐝 𝐊𝐚𝐫 𝐋𝐢𝐲𝐚 𝐊𝐚𝐫𝐨😻\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '12:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 10:30 A𝐌 ⏳\n𝐆𝐨𝐨𝐝 𝐀𝐟𝐭𝐞𝐫𝐍𝐨𝐨𝐧 𝐄𝐯𝐞𝐫𝐲𝐨𝐧𝐞🌞 𝐊𝐢𝐭𝐧𝐢 𝐒𝐚𝐫𝐝𝐢 𝐇𝐚𝐢 𝐁𝐚𝐡𝐚𝐫🥶🥶\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '1:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 11:30 𝐀𝐌 ⏳\n𝐋𝐮𝐧𝐜𝐡 𝐊𝐚𝐫𝐥𝐨 𝐀𝐛 𝐁𝐚𝐛𝐲😇\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '2:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 12:30 𝐏𝐌 ⏳\n𝐘𝐚𝐫 𝐭𝐮𝐦 𝐥𝐨𝐠 𝐤𝐮𝐜𝐡 𝐤𝐚𝐦 𝐝𝐡𝐚𝐦 𝐤𝐚𝐫 𝐥𝐨 😶😐\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '3:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 1:30 𝐏𝐌 ⏳\n𝐓𝐡𝐨𝐝𝐚 𝐀𝐚𝐫𝐚𝐦 𝐊𝐚𝐫𝐥𝐨 𝐀𝐛 𝐁𝐚𝐛𝐲😘\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '4:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 2:30 𝐏𝐌 ⏳\n𝐁𝐚𝐡𝐮𝐭 𝐠𝐚𝐫𝐦𝐢 𝐡𝐚𝐢 𝐀𝐚𝐣 🙆🏻\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '5:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 3:30 𝐏𝐌 ⏳\n𝐭𝐮𝐦 𝐥𝐨𝐠 𝐭𝐡𝐚𝐫𝐤𝐢 𝐇𝐨 🤦🏻\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '6:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 4:30 𝐏𝐌 ⏳\n𝐒𝐚𝐭𝐲 𝐌𝐞 𝐉𝐚𝐢𝐭𝐞 𝐇 𝐒𝐚𝐧𝐚𝐭𝐚𝐧 𝐃𝐡𝐚𝐫𝐦 💖\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '7:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 5:30 𝐏𝐌 ⏳\n𝐊𝐡𝐮𝐬𝐡 𝐑𝐚𝐡𝐧𝐚 𝐌𝐞𝐫𝐞 𝐩𝐲𝐚𝐫𝐞 💞\n𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '8:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 6:30 𝐏𝐌 ⏳\n𝐃𝐢𝐧𝐧𝐞𝐫 𝐊𝐚𝐫𝐥𝐨 𝐒𝐚𝐫𝐞 😋\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '9:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 7:30 𝐏𝐌 ⏳\n𝐌𝐞𝐫𝐞 𝐂𝐮𝐭𝐞 𝐁𝐚𝐛𝐲 💝\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '10:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 8:30 𝐏𝐌 ⏳\n𝐌𝐮𝐬𝐤𝐮𝐫𝐚𝐨 𝐇𝐚𝐬𝐨 𝐇𝐚𝐦𝐞𝐬𝐡𝐚 ☺️\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
},
{
timer: '11:00:00 PM',
message: ['✮͢ 𝐍𝐨𝐰 𝐢𝐭𝐬 𝐭𝐢𝐦𝐞 9:30 P𝐌 ⏳\n𝐀𝐲𝐚𝐧𝐬𝐱 𝐛𝐚𝐛𝐲 𝐤𝐡𝐚𝐧𝐚 𝐤𝐡𝐚𝐲𝐚 𝐚𝐚𝐩𝐧𝐞?\n⁣𝐎𝐰𝐧𝐞𝐫𒌋꯭꯭ 𝐀𝐲𝐚𝐧𝐬𝐡፝֟፝֟ ✭⃝🩷']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};